---
kind: type
id: T:Autodesk.Revit.Exceptions.InternalException
source: html/c52bc6d3-6cd9-26f5-4b27-1646c0711a34.htm
---
# Autodesk.Revit.Exceptions.InternalException

The exception that is thrown when an issue in the Revit code resulted in an unexpected error.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class InternalException : ApplicationException
```

## Remarks
Please contact Autodesk Developer Support with the information about what led to this exception.